paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_transport.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <unity.h>

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <stddef.h>

#include "enc.h"
#include "transport.h"
#include "nrf_error.h"
#include "event.h"
#include "replay_cache.h"
#include "timer_scheduler.h"
#include "nrf_mesh.h"
#include "log.h"
#include "packet_mesh.h"

#define UNUSED_ADDR    0x0000
#define UNICAST_ADDR   0x1201
#define UNICAST_DST    0x0607
#define GROUP_ADDR     0xF00D
#define BROADCAST_ADDR 0xFFFF

#define NETWORK_KEY     {0x7d, 0xd7, 0x36, 0x4c, 0xd8, 0x42, 0xad, 0x18, 0xc1, 0x7c, 0x2b, 0x82, 0x0c, 0x84, 0xc3, 0xd6}
#define APPLICATION_KEY {0x63, 0x96, 0x47, 0x71, 0x73, 0x4f, 0xbd, 0x76, 0xe3, 0xb4, 0x05, 0x19, 0xd1, 0xd9, 0x4a, 0x48}
#define DEVICE_KEY      {0x63, 0x96, 0x47, 0x71, 0x73, 0x4f, 0xbd, 0x76, 0xe3, 0xb4, 0x05, 0x19, 0xd1, 0xd9, 0x4a, 0x48}
#define APPLICATION_ID  0x14

#define IV_INDEX 0x12345678
#define MSG_SEQ_NO 0x000007

#define PACKET_TV0_UNENCRYPTED {0x1B, AD_TYPE_MESH, 0x68, 0x03, 0x00, 0x00, 0x07, 0x12, 0x01, 0xff, 0xff, 0x34, 0x04, 0x12, 0x01, 0x03, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}
#define PACKET_TV0_TRANSPORT   {0x1B, AD_TYPE_MESH, 0x68, 0x03, 0x00, 0x00, 0x07, 0x12, 0x01, 0xff, 0xff, 0x34, 0x5a, 0x99, 0xdf, 0x6e, 0x95, 0x1e, 0x11, 0xc8, 0x10, 0xea, 0x77, 0x15, 0x00, 0x00, 0x00, 0x00}

#define NUM_PACKETS 1

nrf_mesh_assertion_handler_t m_assertion_handler;

static uint8_t m_net_key[NRF_MESH_KEY_SIZE] = NETWORK_KEY;
static uint8_t m_app_key[NRF_MESH_KEY_SIZE] = APPLICATION_KEY;
static uint8_t m_dev_key[NRF_MESH_KEY_SIZE] = DEVICE_KEY;

static uint8_t m_unenc_pkts[NUM_PACKETS][28] = {PACKET_TV0_UNENCRYPTED};

static uint8_t m_enc_pkts[NUM_PACKETS][28] = {PACKET_TV0_TRANSPORT};

static uint8_t m_sar_rx_pkts[2][31] = {{0x1e, AD_TYPE_MESH, 0x68, 0x04, 0x31, 0x29, 0xab, 0x00, 0x03, 0x12, 0x01, 0x80, 0x26, 0xac, 0x01, 0xec, 0xe8, 0x88, 0xaa, 0x21, 0x69, 0x32, 0x6d, 0x23, 0xf3, 0xaf, 0xdf, 0x00, 0x00, 0x00, 0x00},
                                       {0x1e, AD_TYPE_MESH, 0x68, 0x04, 0x31, 0x29, 0xac, 0x00, 0x03, 0x12, 0x01, 0x80, 0x26, 0xac, 0x21, 0xcf, 0xdc, 0x18, 0xc5, 0x2f, 0xde, 0xf7, 0x72, 0x69, 0xff, 0x44, 0x33, 0x00, 0x00, 0x00, 0x00}};


static packet_net_t * mp_net_pkt_out;
static packet_t * mp_packet;
static uint32_t m_network_pkt_out_return = NRF_SUCCESS;

static nrf_mesh_init_params_t * mp_mesh_init_params;

static nrf_mesh_application_secmat_t m_application;
static nrf_mesh_network_secmat_t     m_network;
static nrf_mesh_application_secmat_t m_device_key;

static nrf_mesh_address_t m_addr;

static uint32_t m_seqnum;
static uint32_t m_iv_index;


static unsigned m_event_push_count;
static unsigned m_network_iv_index_set_count = 0;
static unsigned m_beacon_net_iv_update_count = 0;
static unsigned m_relay_count = 0;
static bool is_provisioned = false;


static unsigned m_timers_added;
static timestamp_t m_time_now;

typedef enum
{
    TIMER_UNINITIALIZED = 0,
    TIMER_SCHEDULED,
    TIMER_ABORTED
} timer_state_t;

typedef struct
{
    timer_event_t * p_timer;
    timer_state_t   state;
} transport_timer_t;

static transport_timer_t m_timer_event_buffer[4];

/************************/
/* Test setup functions */
/************************/


void setUp(void)
{

    __LOG_INIT((LOG_SRC_ENC | LOG_SRC_TRANSPORT | LOG_SRC_CCM |LOG_SRC_TEST), 4, LOG_CALLBACK_DEFAULT);

    packet_mgr_init(mp_mesh_init_params);
    packet_mgr_alloc((packet_generic_t **) &mp_packet, sizeof(packet_t));

    transport_init(NULL);

    m_network_iv_index_set_count = 0;
    m_event_push_count = 0;
    m_beacon_net_iv_update_count = 0;
    m_relay_count = 0;
    m_network_pkt_out_return = NRF_SUCCESS;

    is_provisioned = false;

    memset(m_timer_event_buffer, 0, sizeof(m_timer_event_buffer));
    m_timers_added = 0;
    m_time_now = 0;
}

void tearDown(void)
{
    replay_cache_clear();
    packet_mgr_decref(mp_packet);
}

void setup_test_packet(const uint8_t * network_packet)
{
    uint32_t size = (network_packet[0] + 1) + sizeof(ble_packet_hdr_t) + BLE_GAP_ADDR_LEN;
    printf("Size: %u %u\n", size, network_packet[0]);
    TEST_ASSERT(size <= BLE_ADV_PACKET_MAX_LENGTH);

