paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_transport.c
    /* Allocate and construct an incoming packet: */
    packet_mgr_alloc((packet_generic_t **) &mp_packet, size);
    memset(mp_packet, 0, size);

    packet_payload_size_set(mp_packet, network_packet[0] + 1);
    memcpy(mp_packet->payload, network_packet, network_packet[0] + 1);
}

/********************/
/* Mockup functions */
/********************/

void bearer_event_critical_section_begin(void) {}
void bearer_event_critical_section_end(void) {}

timestamp_t timer_now()
{
    return m_time_now;
}

void timer_sch_reschedule(timer_event_t * p_timer, timestamp_t time)
{
    if (p_timer != NULL)
    {
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "(Re)-scheduling timer!\n");
        for (int i = 0; i < 4; ++i)
        {
            if (m_timer_event_buffer[i].p_timer == p_timer)
            {
                m_timer_event_buffer[i].state = TIMER_SCHEDULED;
                break;
            }

            if (m_timer_event_buffer[i].state == TIMER_UNINITIALIZED)
            {
                m_timer_event_buffer[i].p_timer = p_timer;
                m_timer_event_buffer[i].state = TIMER_SCHEDULED;
                m_timers_added++;
                break;
            }
        }
    }
}

void timer_sch_abort(timer_event_t * p_timer)
{
    if (p_timer)
    {
        for (int i = 0; i < 4; ++i)
        {
            if (m_timer_event_buffer[i].p_timer == p_timer)
            {
                m_timer_event_buffer[i].state = TIMER_ABORTED;
                break;
            }

            if (m_timer_event_buffer[i].state == TIMER_UNINITIALIZED)
            {
                m_timer_event_buffer[i].p_timer = p_timer;
                m_timer_event_buffer[i].state = TIMER_ABORTED;
                break;
            }
        }
    }
}

uint32_t beacon_net_iv_update(const nrf_mesh_network_secmat_t * p_net_secmat)
{
    m_beacon_net_iv_update_count++;
    return NRF_SUCCESS;
}

uint32_t network_make_derived_keys(nrf_mesh_network_secmat_t * p_net_secmat)
{
    return NRF_SUCCESS;
}

uint32_t net_state_seqnum_alloc(uint32_t * p_seqnum)
{
    *p_seqnum = m_seqnum++;
    return NRF_SUCCESS;
}

uint32_t network_iv_index_set(nrf_mesh_network_secmat_t * p_net_secmat, uint32_t iv_index)
{
    m_network_iv_index_set_count++;
    return NRF_SUCCESS;
}

static void network_pkt_out_mock_reset(void)
{
    if(mp_net_pkt_out != NULL)
    {
        free(mp_net_pkt_out);
        mp_net_pkt_out = NULL;
    }
}

uint32_t network_pkt_out(packet_t * p_packet, uint16_t key_index)
{
    /* __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, ) */
    if(mp_net_pkt_out != NULL)
    {
        free(mp_net_pkt_out);
    }

    mp_net_pkt_out = malloc(p_packet->payload[0] + 1);
    memcpy(mp_net_pkt_out, p_packet->payload, p_packet->payload[0] + 1);
    __LOG_XB(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "network_pkt_out: ", (const uint8_t *) mp_net_pkt_out, p_packet->payload[0] + 1);
    return m_network_pkt_out_return;
}

uint32_t network_pkt_relay(packet_net_t * p_net_packet, nrf_mesh_network_secmat_t * const p_net_secmat)
{
    m_relay_count++;
    return NRF_SUCCESS;
}

uint32_t network_iv_update_acknowledge(nrf_mesh_network_secmat_t * p_net_secmat)
{
    return NRF_SUCCESS;
}

void event_handle(nrf_mesh_evt_t * p_event)
{
    __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Pushing event: %u.\n", p_event->type);
    m_event_push_count ++;
}

uint32_t net_state_rx_iv_index_get(uint8_t ivi)
{
    TEST_ASSERT_EQUAL(ivi, ivi & 0x01);
    if (ivi == (m_iv_index & 0x01))
    {
        return m_iv_index;
    }
    else
    {
        return m_iv_index - 1;
    }
}

uint32_t net_state_tx_iv_index_get(void)
{
    return m_iv_index;
}

void net_state_iv_index_lock(bool lock) { /* Ignore */ }

void nrf_mesh_app_secmat_next_get(const nrf_mesh_network_secmat_t * p_network_secmat, uint8_t aid, const nrf_mesh_application_secmat_t ** pp_app_secmat)
{
    TEST_ASSERT_EQUAL_PTR(&m_network, p_network_secmat);
    if (*pp_app_secmat == NULL && aid == m_application.aid)
    {
        *pp_app_secmat = &m_application;
        return;
    }
    *pp_app_secmat = NULL;
}

void nrf_mesh_devkey_secmat_get(uint16_t unicast_addr, const nrf_mesh_application_secmat_t ** pp_app_secmat)
{
    if (*pp_app_secmat == NULL)
    {
        *pp_app_secmat = &m_device_key;
        return;
    }
}

bool nrf_mesh_rx_address_get(uint16_t raw_address, nrf_mesh_address_t * p_address)
{
    if (raw_address == m_addr.value)
    {
        memcpy(p_address, &m_addr, sizeof(m_addr));
        return true;
    }
    else if (raw_address == 0xFFFF)
    {
        p_address->type = NRF_MESH_ADDRESS_TYPE_GROUP;
        p_address->value = 0xFFFF;
        p_address->p_virtual_uuid = NULL;
        return true;
    }
    return false;
}
/*********************/
/* Utility functions */
/*********************/

static void provision(const uint8_t * app_key, const uint8_t * device_key, uint32_t iv_index, uint32_t msg_seq_no)
{
    memset(&m_network, 0, sizeof(nrf_mesh_network_secmat_t));
    memcpy(m_network.encryption_key, m_net_key, NRF_MESH_KEY_SIZE);
    m_seqnum = msg_seq_no;
    m_iv_index = iv_index;

    uint32_t status = network_make_derived_keys(&m_network);
    TEST_ASSERT_EQUAL_HEX32(NRF_SUCCESS, status);

    memset(&m_application, 0, sizeof(nrf_mesh_application_secmat_t));
    memcpy(m_application.key, app_key, NRF_MESH_KEY_SIZE);
    m_application.aid = APPLICATION_ID;

    memset(&m_device_key, 0, sizeof(nrf_mesh_application_secmat_t));
    memcpy(m_device_key.key, device_key, NRF_MESH_KEY_SIZE);
    m_device_key.aid = 0;
    is_provisioned = true;
}

/******************/
/* Test functions */
/******************/

void test_transport_init(void)
{
    transport_init(mp_mesh_init_params);
}

void test_transport_pkt_in(void)
{
    uint32_t status;
    packet_meta_t meta = {0};
    uint8_t meta_addr[6];
    meta.p_addr = meta_addr;

    nrf_mesh_address_t unicast_addr = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST, .value = UNICAST_DST, .p_virtual_uuid = NULL};
    memcpy(&m_addr, &unicast_addr, sizeof(unicast_addr));

    /* Add keys: */
    provision(m_app_key, m_dev_key, IV_INDEX, MSG_SEQ_NO);

    for (int i = 0; i < NUM_PACKETS; ++i)
    {
        replay_cache_clear();
        printf("Packet %d\n", i);
        setup_test_packet(m_enc_pkts[i]);
        packet_net_t * p_net_pkt = packet_net_packet_get(mp_packet);
        packet_net_t * p_out     = (packet_net_t *) m_unenc_pkts[i];
        packet_mesh_t * p_mesh_packet = (packet_mesh_t *) p_net_pkt;

        printf("ivi: 0x%02x\n"
               "nid: 0x%02x\n"
               "ctl: 0x%02x\n"
               "ttl: 0x%02x\n"
               "seq: 0x%08x\n"
               "src: 0x%04x\n"
               "dst: 0x%04x\n"
               "seg: 0x%02x\n",
               packet_mesh_net_ivi_get(p_mesh_packet),
               packet_mesh_net_nid_get(p_mesh_packet),
               packet_mesh_net_ctl_get(p_mesh_packet),
               packet_mesh_net_ttl_get(p_mesh_packet),
               packet_mesh_net_seq_get(p_mesh_packet),
               packet_mesh_net_src_get(p_mesh_packet),
               packet_mesh_net_dst_get(p_mesh_packet),
               packet_mesh_trs_seg_get(p_mesh_packet)
            );

        p_net_pkt->header.dst = 0;

        /* Test function. */
        status = transport_pkt_in(p_net_pkt, &meta, &m_network, m_iv_index);
        TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_ADDR, status);

        p_net_pkt->header.dst = 0xffff;

        status = transport_pkt_in(p_net_pkt, &meta, &m_network, m_iv_index);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, status);

        /* Packet should have been pushed to app.  */
        TEST_ASSERT_EQUAL(i + 1, m_event_push_count);
        TEST_ASSERT_EQUAL_HEX8_ARRAY(p_out->payload, p_net_pkt->payload, packet_net_payload_size_get(p_net_pkt) - 8);
    }
}

void test_transport_reject_invalid_app_key(void)
{
    uint32_t status;
    packet_meta_t meta = {0};
    uint8_t meta_addr[6];
    meta.p_addr = meta_addr;

    nrf_mesh_address_t address = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST, .value = UNICAST_ADDR, .p_virtual_uuid = NULL};
    memcpy(&m_addr, &address, sizeof(m_addr));
    setup_test_packet(m_enc_pkts[0]);

