paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_transport.c
    packet_net_t * p_net_pkt = packet_net_packet_get(mp_packet);

    uint8_t invalid_app_key[16];

    memcpy(invalid_app_key, m_app_key, sizeof(m_app_key));
    invalid_app_key[3] = 0x00;

    /* Add key and address. */
    provision(invalid_app_key, m_dev_key, IV_INDEX, MSG_SEQ_NO);

    p_net_pkt->header.dst = 0;
    /* Test function. */
    status = transport_pkt_in(p_net_pkt, &meta, &m_network, m_iv_index);
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_ADDR, status);

    p_net_pkt->header.dst = LE2BE16(UNICAST_ADDR);
    status = transport_pkt_in(p_net_pkt, &meta, &m_network, m_iv_index);

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, status);

    /* Packet should be silently ignored */
    TEST_ASSERT_EQUAL(0, m_event_push_count);

}

void test_transport_replay_cache(void)
{
    packet_meta_t meta = {0};
    uint32_t status;
    uint8_t meta_addr[6];
    meta.p_addr = meta_addr;
    nrf_mesh_address_t address = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST, .value = 0x0607, .p_virtual_uuid = NULL};
    memcpy(&m_addr, &address, sizeof(m_addr));
    setup_test_packet(m_enc_pkts[0]);

    packet_net_t * p_net_pkt = packet_net_packet_get(mp_packet);
    packet_net_t * p_out_enc = (packet_net_t *) m_enc_pkts[0];
    packet_net_t * p_out_unenc = (packet_net_t *) m_unenc_pkts[0];

    /* Add keys: */
    provision(m_app_key, m_dev_key, IV_INDEX, MSG_SEQ_NO);

    /* Check that packet is not added to cache if crypto fails */
    /* Mess up MIC */
    p_net_pkt->payload[0] -= 1;
    status = transport_pkt_in(p_net_pkt, &meta, &m_network, m_iv_index);
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, status);

    setup_test_packet(m_enc_pkts[0]);

    /* Test function. */
    status = transport_pkt_in(packet_net_packet_get(mp_packet), &meta, &m_network, m_iv_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, status);

    /* Setup same packet again. */
    setup_test_packet(m_enc_pkts[0]);

    status = transport_pkt_in(packet_net_packet_get(mp_packet), &meta, &m_network, m_iv_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, status);

    /* Should have been caught by replay protection and not decrypted */
    TEST_ASSERT_EQUAL_HEX8_ARRAY(p_out_enc, packet_net_packet_get(mp_packet), packet_net_payload_size_get(packet_net_packet_get(mp_packet)) - 8);

    replay_cache_clear();

    /* Setup same packet again. */
    setup_test_packet(m_enc_pkts[0]);
    p_net_pkt->payload[0] += 1;

    status = transport_pkt_in(p_net_pkt, &meta, &m_network, m_iv_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, status);

    TEST_ASSERT_EQUAL_HEX8_ARRAY(p_out_unenc, p_net_pkt, packet_net_payload_size_get(p_net_pkt) - 8);
}

void test_virtual_addressing(void)
{
    TEST_IGNORE_MESSAGE("Not implemented");
}

void test_trs_sar_rx(void)
{
    const uint8_t devkey[] = {0x9d, 0x6d, 0xd0, 0xe9, 0x6e, 0xb2, 0x5d, 0xc1, 0x9a, 0x40, 0xed, 0x99, 0x14, 0xf8, 0xf0, 0x3f};
    provision(m_app_key, devkey, 0x12345678, 0x3129ab);

    nrf_mesh_address_t address = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST, .value = 0x1201, .p_virtual_uuid = NULL};
    memcpy(&m_addr, &address, sizeof(m_addr));

    uint32_t status = NRF_SUCCESS;
    packet_meta_t meta = {0};
    uint8_t meta_addr[6];
    meta.p_addr = meta_addr;

    for (int i = 0; i < 2; ++i)
    {
        setup_test_packet(&m_sar_rx_pkts[i][0]);
        status = transport_pkt_in(packet_net_packet_get(mp_packet), &meta, &m_network, m_iv_index);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, status);
    }

    TEST_ASSERT_EQUAL(2, m_timers_added);

    status = transport_sar_process();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, status);
    TEST_ASSERT_EQUAL(1, m_event_push_count);
}

void test_trs_sar_rx_giveup(void)
{
    /**
     * This test only sends the first segment in a SAR transaction and fires the
     * session timeout timer. The transport SAR should report back with a
     * SAR_SESSION_CANCELLED event.
     */
    uint8_t appkey[] = {0xf1, 0xa2, 0x4a, 0xbe, 0xa9, 0xb8, 0x6c, 0xd3,
                        0x33, 0x80, 0xa2, 0x4c, 0x4d, 0xfb, 0xe7, 0x43};

    provision(appkey, m_dev_key, 0x01020304, 0x08090a);

    nrf_mesh_address_t address = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST, .value = UNICAST_ADDR, .p_virtual_uuid = NULL};
    memcpy(&m_addr, &address, sizeof(m_addr));

    packet_meta_t meta = {0};
    uint8_t meta_addr[6];
    meta.p_addr = meta_addr;

    setup_test_packet(m_sar_rx_pkts[0]);
    packet_net_t * p_net_pkt = packet_net_packet_get(mp_packet);
    TEST_ASSERT_NOT_NULL(p_net_pkt);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_pkt_in(p_net_pkt, &meta, &m_network, m_iv_index));

    /* On RX two timers are added: the session timer and the segment acknowledgement timer. */
    TEST_ASSERT_EQUAL(2, m_timers_added);

    /* First timer added is the session timeout timer. */
    m_timer_event_buffer[0].p_timer->cb(0, m_timer_event_buffer[0].p_timer->p_context);

    TEST_ASSERT_EQUAL(1, m_event_push_count);
}


void test_trs_sar_rx_bigboy(void)
{
    TEST_IGNORE();
}

void test_trs_sar_multiple_session_tx(void)
{
    /**
     * This tests SAR TX without receiving an ACK before the session timeout
     * callback is called.
     */
    uint8_t appkey[] = {0xf1, 0xa2, 0x4a, 0xbe, 0xa9, 0xb8, 0x6c, 0xd3,
                        0x33, 0x80, 0xa2, 0x4c, 0x4d, 0xfb, 0xe7, 0x43};

    uint8_t data[] = {0x80, 0x11, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07,
                      0x08, 0x09, 0x0a};

    provision(appkey, m_dev_key, 0x01020304, 0x08090a);

    nrf_mesh_address_t unicast_addr1 = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST, .value = 0x0d0e};

    nrf_mesh_tx_params_t params =
        {
            .p_data = &data[0],
            .data_len = sizeof(data),
            .src = 0x0b0c,
            .security_material.p_app = &m_application,
            .security_material.p_net = &m_network,
            .ttl = 0x12
        };
    memcpy(&params.dst, &unicast_addr1, sizeof(params.dst));
    uint32_t ref;

    for (uint32_t i=0;i<TRANSPORT_SAR_TX_SESSIONS_MAX;i++)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx_sar(&params, &ref));
    }
    TEST_ASSERT_EQUAL(NRF_ERROR_NO_MEM, transport_tx_sar(&params, &ref));
}

void test_trs_sar_opt_retries_tx(void)
{
    /**
     * This tests SAR TX without receiving an ACK before the session timeout
     * callback is called.
     */
    uint8_t appkey[] = {0xf1, 0xa2, 0x4a, 0xbe, 0xa9, 0xb8, 0x6c, 0xd3,
                        0x33, 0x80, 0xa2, 0x4c, 0x4d, 0xfb, 0xe7, 0x43};

    uint8_t data[] = {0x80, 0x11, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07,
                      0x08, 0x09, 0x0a};

    provision(appkey, m_dev_key, 0x01020304, 0x08090a);

    nrf_mesh_address_t unicast_addr = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST, .value = 0x0d0e};
    nrf_mesh_address_t group_addr   = {.type = NRF_MESH_ADDRESS_TYPE_GROUP, .value = GROUP_ADDR};

