paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_transport.c
    nrf_mesh_tx_params_t params =
        {
            .p_data = &data[0],
            .data_len = sizeof(data),
            .src = 0x0b0c,
            .security_material.p_app = &m_application,
            .security_material.p_net = &m_network,
            .ttl = 0x12
        };
    memcpy(&params.dst, &unicast_addr, sizeof(params.dst));
    uint32_t ref;
    /* Default retry value */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx_sar(&params, &ref));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_sar_process());

    memcpy(&params.dst, &group_addr, sizeof(params.dst));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx_sar(&params, &ref));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_sar_process());

    /* Re-init */
    setUp();
    /* Zero retry value */
      nrf_mesh_opt_t opt = {.opt.val = 0};
    memcpy(&params.dst, &unicast_addr, sizeof(params.dst));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_opt_set(NRF_MESH_OPT_TRS_SAR_TX_RETRIES, &opt));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx_sar(&params, &ref));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_sar_process());

    memcpy(&params.dst, &group_addr, sizeof(params.dst));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_opt_set(NRF_MESH_OPT_TRS_SAR_TX_RETRIES, &opt));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx_sar(&params, &ref));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_sar_process());

    /* Re-init */
    setUp();
    /* MAX retry value*/
    opt.opt.val = TRANSPORT_SAR_TX_RETRIES_MAX;
    memcpy(&params.dst, &unicast_addr, sizeof(params.dst));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_opt_set(NRF_MESH_OPT_TRS_SAR_TX_RETRIES, &opt));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx_sar(&params, &ref));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_sar_process());

    memcpy(&params.dst, &group_addr, sizeof(params.dst));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_opt_set(NRF_MESH_OPT_TRS_SAR_TX_RETRIES, &opt));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx_sar(&params, &ref));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_sar_process());

    /* INVALID retry value*/
    opt.opt.val = TRANSPORT_SAR_TX_RETRIES_MAX + 1;
    memcpy(&params.dst, &unicast_addr, sizeof(params.dst));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, transport_opt_set(NRF_MESH_OPT_TRS_SAR_TX_RETRIES, &opt));
}

void test_trs_sar_tx_giveup(void)
{
    /**
     * This tests SAR TX without receiving an ACK before the session timeout
     * callback is called.
     */
    uint8_t appkey[] = {0xf1, 0xa2, 0x4a, 0xbe, 0xa9, 0xb8, 0x6c, 0xd3,
                        0x33, 0x80, 0xa2, 0x4c, 0x4d, 0xfb, 0xe7, 0x43};

    uint8_t data[] = {0x80, 0x11, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07,
                      0x08, 0x09, 0x0a};

    provision(appkey, m_dev_key, 0x01020304, 0x08090a);

    nrf_mesh_address_t address = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST, .value = 0x0d0e};

    nrf_mesh_tx_params_t params =
        {
            .p_data = &data[0],
            .data_len = sizeof(data),
            .src = 0x0b0c,
            .security_material.p_app = &m_application,
            .security_material.p_net = &m_network,
            .ttl = 0
        };
    memcpy(&params.dst, &address, sizeof(params.dst));
    uint32_t ref;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx_sar(&params, &ref));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_sar_process());

    /* On TX two timers are added: The session timer and the TX retry timer. */
    TEST_ASSERT_EQUAL(2, m_timers_added);

    /* The first timer added is the session timeout timer. */
    m_timer_event_buffer[0].p_timer->cb(0, m_timer_event_buffer[0].p_timer->p_context);

    TEST_ASSERT_EQUAL(1, m_event_push_count);
}

void test_trs_maxlen_get(void)
{
    nrf_mesh_opt_t opt = {.len = 0, .opt.val = 0};

    /* Default: 32bit TMIC + 32bit NMIC */
    TEST_ASSERT_EQUAL(11, transport_unseg_maxlen_get());
    TEST_ASSERT_EQUAL(380, transport_seg_maxlen_get());

    opt.opt.val = 1;
    transport_opt_set(NRF_MESH_OPT_TRS_SZMIC, &opt);

    /* 64bit MIC + 32bit NMIC */
    TEST_ASSERT_EQUAL(376, transport_seg_maxlen_get());

    opt.opt.val = 0;
    transport_opt_set(NRF_MESH_OPT_TRS_SZMIC, &opt);
}

void test_big_mic(void)
{
    TEST_IGNORE_MESSAGE("Big MIC is only supported for segmented messages, contrary to what sample data #24 would've led you to believe.");

    packet_meta_t meta = {0};
    uint8_t meta_addr[6];
    meta.p_addr = meta_addr;
    uint32_t status = 0;

    uint8_t my_virtual_addr[] = {0xf4, 0xa0, 0x02, 0xc7, 0xfb, 0x1e, 0x4c, 0xa0, 0xa4, 0x69, 0xa0, 0x21, 0xde, 0x0d, 0xb8, 0x75};
    nrf_mesh_address_t my_addr = {.type = NRF_MESH_ADDRESS_TYPE_VIRTUAL,
                                  .value = 0x8012, .p_virtual_uuid = my_virtual_addr};
    nrf_mesh_address_t my_second_addr = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST,
                                         .value = 0x1234};
    memcpy(&m_addr, &my_second_addr, sizeof(m_addr));
    fflush(stdout);

    uint8_t packet_array[] = {0x1b, AD_TYPE_MESH,
                              /* Header */
                              0xe8, 0x03, 0x07, 0x08, 0x0d, 0x12, 0x34, 0x97, 0x36, 0x34, 0xde, 0x15, 0x47, 0xb9, 0x16, 0x58, 0xf1, 0x61, 0x62, 0x74, 0xfe, 0x58, 0x00, 0x00, 0x00, 0x00};

    uint8_t unenc_packet_array[] = {0x1b, AD_TYPE_MESH,
                                    /* Header */
                                    0xe8, 0x03, 0x07, 0x08, 0x0d, 0x12, 0x34, 0x97, 0x36, 0x34, 0xea, 0x0a, 0x00, 0xff, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
    /* Add keys: */
    __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Add keys\n");
    fflush(stdout);
    provision(m_app_key, m_dev_key, 0x12345677, 0x07080d);
    setup_test_packet(packet_array);

    packet_net_t * p_net_pkt = packet_net_packet_get(mp_packet);
    packet_net_t * p_out     = (packet_net_t *) unenc_packet_array;
    TEST_ASSERT_NOT_NULL(p_net_pkt);

    status = transport_pkt_in(p_net_pkt, &meta, &m_network, m_iv_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, status);

