paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_transport.c
    /* Packet should have been pushed to app. */
    __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Check packet in app\n");
    fflush(stdout);
    TEST_ASSERT_EQUAL(1, m_event_push_count);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(p_out->payload,
                                 p_net_pkt->payload,
                                 (packet_net_payload_size_get(p_net_pkt) -
                                  2 * 8));

    nrf_mesh_opt_t opt = {.len = 4, .opt.val = 1};
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_opt_set(NRF_MESH_OPT_TRS_SZMIC, &opt));

    uint8_t data[4] = {0xea, 0x0a, 0x00, 0xff};

    /* Test TX */
    __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Test TX\n");

    fflush(stdout);
    nrf_mesh_tx_params_t params =
        {
            .p_data = &data[0],
            .data_len = sizeof(data),
            .src = 0x1234,
            .security_material.p_app = &m_application,
            .security_material.p_net = &m_network,
            .ttl = 0x03
        };
    memcpy(&params.dst, &my_addr, sizeof(params.dst));
    network_pkt_out_mock_reset();

    status = transport_tx(&params, NULL);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, status);
    TEST_ASSERT_NOT_NULL(mp_net_pkt_out);


    p_net_pkt = mp_net_pkt_out;
    p_out     = (packet_net_t *) packet_array;

    /* Compare the correct MIC as well */
    __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Check MIC\n");
    fflush(stdout);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(p_out->payload,
                                 p_net_pkt->payload,
                                 (packet_net_payload_size_get(p_net_pkt) - 8));
}
